app/controllers/access_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'rana@bkam.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def attempt_login
  	if params[:email].present? && params[:password].present?
  		founduser = User.where(:email => params[:email]).first

INSERT INTO `users` (`first_name`, `last_name`, `country`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Rana', 'Ahmed', 'Egypt', 'r@bkam.com', '$2a$10$6lyPLz6VxWYx1XqHf4z61e.YDbB8u7PcmWYrOQFhV7OG5tol/xyoS', '2015-09-27 14:36:08', '2015-09-27 14:36:08')
---
  def attempt_signup
  	# instantiate a new obj
    @user = User.new(user_params)
    # save the object
    if @user.save