app/controllers/goals_controller.rb

SELECT `goals`.* FROM `goals` WHERE `goals`.`user_id` = 2 AND `goals`.`achieved` = 1
---
  def achieved_goals
    @goals = Goal.where(:user_id => @user.id, :achieved => true)

SELECT `goals`.* FROM `goals` WHERE `goals`.`user_id` = 2 AND `goals`.`achieved` = 0
---
  def index
    @goals = Goal.where(:user_id => @user.id, :achieved => false)

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1
---
  def show
    @goal = Goal.find(params[:id])

INSERT INTO `goals` (`title`, `description`, `start_date`, `end_date`, `user_id`, `created_at`, `updated_at`) VALUES ('first goal', 'start your web app hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh', '2015-01-01', '2015-02-02', 2, '2015-10-02 13:29:24', '2015-10-02 13:29:24')
---
  def create
    # instantiate a new obj
    @goal = Goal.new(goal_params)
    # save the object
    if @goal.save

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1
---
  def edit
    @goal = Goal.find(params[:id])

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1
UPDATE `goals` SET `start_date` = '2015-01-01', `end_date` = '2015-02-02', `updated_at` = '2015-09-27 16:57:44' WHERE `goals`.`id` = 4
---
  def update
    # find obj
    @goal = Goal.find(params[:id])
    # update the object
    if @goal.update_attributes(goal_params)

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 15 LIMIT 1
---
  def complete_goal
    @goal = Goal.find(params[:id])

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 15 LIMIT 1
UPDATE `goals` SET `achieved` = 1, `updated_at` = '2015-10-04 14:31:04' WHERE `goals`.`id` = 17
---
  def update_complete_goal
    @goal = Goal.find(params[:id])
    if @goal.update_attributes(params.require(:goal).permit(:achieved, :user_id))

SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1
---
  def delete
    @goal = Goal.find(params[:id])

DELETE FROM `goals` WHERE `goals`.`id` = 1
SELECT  `goals`.* FROM `goals` WHERE `goals`.`id` = 14 LIMIT 1
---
  def destroy
    goal = Goal.find(params[:id]).destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    def find_user
      if session['user_id']
        @user = User.find(session['user_id'].to_i)